* the react way

** this and arrow function example

#+begin_src typescript
let yearData = {
    year: 2022,
    printYear: function () {
        console.log(this.year);
        setTimeout(() => {
            console.log("After 2 seconds");
            console.log(this.year);
            }, 2000);
        },
    };
yearData.printYear();
#+end_src

#+RESULTS:
: 2022
: After 2 seconds
: 2022
